src/Documents/ИнвентаризацияОрдерногоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИнвентаризацияОрдерногоСклада</Name>
			<Comment>Инвентаризация ордерного склада</Comment>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровОрдерныйСклад</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, на котором проводим инвентаризацию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание для проведения инвентаризации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Таблица товаров и услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Comment>Учетное количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Comment>Место хранения ячеистого склада</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровОрдерныйСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровОрдерныйСклад</Name>
			<Comment>Остатки товаров на ордерном складе</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Храним ТОЛЬКО в базовых единицах измерения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Comment>Ячейка склада</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Используется только для аналитики. Это НЕ означает, что в ресурс «Количество» пишется в данной единице измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>Виды складов(Обычный, Ордерный, Ордерный и ячеистый)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
					<Comment>Обычный склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ордерный</Name>
					<Comment>Ордерный  склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрдерныйЯчеистый</Name>
					<Comment>Ордерный и ячеистый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ячеистый</Name>
					<Comment>Ячеистый склад</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыУчетаЕдиницИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчетаЕдиницИзмерения</Name>
			<Comment>Виды учета единиц измерения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВедется</Name>
					<Comment>Учет единиц измерения не ведется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедетсяПоПриходу</Name>
					<Comment>Учет единиц измерения ведется по приходу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедетсяПоПриходуИОтгрузке</Name>
					<Comment>Учет единиц измерения ведется по приходу и отгрузке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Продукция</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИнвентаризацияОрдерногоСклада/Ext/ManagerModule.bsl
// Модуль менеджера документа "Инвентаризация ордерного склада"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Заполнение количества по остаткам
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ЗаполнитьРасчетноеКоличество(Объект, Строка)
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("СкладКомпании,Номенклатура,ХарактеристикаНоменклатуры");
	СтруктураОтбора.СкладКомпании              = Объект.СкладКомпании;
	СтруктураОтбора.Номенклатура               = Строка.Номенклатура;
	СтруктураОтбора.ХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры;
	Если (Объект.СкладКомпании.ВидСклада  = Перечисления.ВидыСкладов.Ячеистый ИЛИ Объект.СкладКомпании.ВидСклада  = Перечисления.ВидыСкладов.ОрдерныйЯчеистый) И ЗначениеЗаполнено(Строка.Ячейка) Тогда
		СтруктураОтбора.Вставить("Ячейка", Строка.Ячейка);
	КонецЕсли; 
	Если НЕ Объект.СкладКомпании.УчетЕдиницИзмерения = Перечисления.ВидыУчетаЕдиницИзмерения.НеВедется Тогда
		СтруктураОтбора.Вставить("ЕдиницаИзмерения", Строка.ЕдиницаИзмерения);
	КонецЕсли;
	МоментВремени 	= ?(Объект.Ссылка.Пустая(),Новый МоментВремени(КонецДня(Объект.Дата)),Объект.Ссылка.МоментВремени());
	ТаблицаОстатков = РегистрыНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(МоментВремени,СтруктураОтбора,,"Количество");
	Если ТаблицаОстатков.Количество() > 0 Тогда
		КоличествоОстаток = ТаблицаОстатков.Итог("Количество");
		Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
			КоличествоОстаток = КоличествоОстаток; 
		Иначе
			КоличествоОстаток = ?(Строка.ЕдиницаИзмерения.Коэффициент = 0, 0, КоличествоОстаток / Строка.ЕдиницаИзмерения.Коэффициент);
		КонецЕсли; 
		Строка.Количество = КоличествоОстаток;
	Иначе
		Строка.Количество = 0;
	КонецЕсли;
	
	// пересчет
	ТоварыКоличествоПриИзменении(Объект, Строка);
	Если Строка.КоличествоУчет = 0 Тогда 
		Строка.КоличествоУчет=Строка.Количество; 
	КонецЕсли;
	ТоварыКоличествоУчетПриИзменении(Объект, Строка);
	
КонецПроцедуры

// Заполнение количества разницы
//
// Параметры:
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ЗаполнитьКоличествоРазница(Строка) Экспорт
	
	Строка.КоличествоРазница = Строка.КоличествоУчет - Строка.Количество;
	
КонецПроцедуры

// Функция возвращает запрос для заполнения
//
Функция ПолучитьЗапросДляЗаполнения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровОрдерныйСкладОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиТоваровОрдерныйСкладОстатки.Ячейка КАК Ячейка,
	|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 0) = 0
	|			ТОГДА ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток
	|		ИНАЧЕ ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток / ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 0) = 0
	|			ТОГДА ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток
	|		ИНАЧЕ ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток / ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК КоличествоУчет
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(
	|			&Момент,
	|			СкладКомпании = &СкладКомпании
	|				И НЕ Номенклатура.ВидНоменклатуры = &Услуга
	|				И Номенклатура В (&СписокНоменклатуры)) КАК ОстаткиТоваровОрдерныйСкладОстатки";
	
	Возврат Запрос;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("СкладКомпании");
	
	ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	ОбязательныеРеквизиты.Добавить("Товары.ЕдиницаИзмерения");
	ОбязательныеРеквизиты.Добавить("Товары.Коэффициент");
	Если Объект.СкладКомпании.ВидСклада  = Перечисления.ВидыСкладов.ОрдерныйЯчеистый Тогда
		ОбязательныеРеквизиты.Добавить("Товары.Ячейка");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары=Новый Массив();
	УникальныеТовары.Добавить("Номенклатура");
	УникальныеТовары.Добавить("ЕдиницаИзмерения");
	УникальныеТовары.Добавить("ХарактеристикаНоменклатуры");
	Если Объект.СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.ОрдерныйЯчеистый Тогда
		УникальныеТовары.Добавить("Ячейка");
	КонецЕсли;
	
	// Структура уникальных реквизитов табличных частей
	УникальныеТабличныеЧасти=Новый Структура();
	УникальныеТабличныеЧасти.Вставить("Товары",УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	КонтролируемыеРеквизиты.Вставить("СкладКомпании", Ложь);
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	ПараметрыДействия.Вставить("ПересчетСуммы", ЛОЖЬ);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
		
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Проект".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПроектПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПроектПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПроектПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Склад компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкладКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
		
	Для Каждого Строка Из Объект.Товары Цикл
		ЗаполнитьРасчетноеКоличество(Объект, Строка);
		ЗаполнитьКоличествоРазница(Строка)
	КонецЦикла;
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.СкладКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // СкладКомпанииПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРасчетноеКоличество(Объект, Строка);
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия);
	
	ЗаполнитьРасчетноеКоличество(Объект, Строка);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия);
	
	ЗаполнитьРасчетноеКоличество(Объект, Строка);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.КоличествоПриИзменении(Объект, Строка, ПараметрыДействия);
	ЗаполнитьКоличествоРазница(Строка);
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоУчетПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЗаполнитьКоличествоРазница(Строка);
	
КонецПроцедуры // ТоварыКоличествоУчетПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ячейка" в таблице "Товары".
//
// Параметры:
//  Объект 
//	Строка - строка табличной части
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЯчейкаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЗаполнитьРасчетноеКоличество(Объект, Строка);
	
КонецПроцедуры // ЯчейкаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ИнвентаризацияОрдерногоСклада",
		"ПФ_MXL_ИнвентаризацияОрдерногоСклада",
		НСтр("ru = 'Инвентаризация ордерного склада'"),
		СсылкаНаДокумент );
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Обработка.ПечатьИНВ",
		"ПФ_MXL_ИНВ3",
		НСтр("ru = 'ИНВ3 (Инвентаризационная опись)'"),
		СсылкаНаДокумент);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Обработка.ПечатьИНВ",
		"ПФ_MXL_ИНВ19",
		НСтр("ru = 'ИНВ19 (Сличительная ведомость)'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ИнвентаризацияОрдерногоСклада") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ИнвентаризацияОрдерногоСклада",
															НСтр("ru = 'Инвентаризация ордерного склада'"),
															ПечатьИнвентаризацияОрдерногоСклада(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ПечатьИнвентаризацияОрдерногоСклада(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияОрдерногоСклада_ИнвентаризацияОрдерногоСклада";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияОрдерногоСклада.ПФ_MXL_ИнвентаризацияОрдерногоСклада");
		
		ОбластьШапкаТаблицы    = УправлениеПечатьюПлатформа.ПривестиМакетПечатнойФормы(Макет, Документ);
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Вывод заголовка документа
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ, НСтр("ru = 'Инвентаризация ордерного склада'"));
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		Если ЗначениеЗаполнено(Документ.ПодразделениеКомпании) И ЗначениеЗаполнено(Документ.ПодразделениеКомпании.КПП) Тогда
			СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= СтрЗаменить(СтрокаПредставления, ОбщегоНазначения.ПолучитьКППНаДату(Документ.Организация, ДатаДокумента), ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеКомпании, ДатаДокумента));
		Иначе	
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ПредставлениеСклада	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.СкладКомпании);
	
		
		// Вывод свойств
		УправлениеПечатьюПлатформа.ЗаполнитьСвойствамиОбъекта(ОбластьЗаголовок, Документ);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// Готовим шапку
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		СтруктураИтоговПоСтранице = Новый Структура();
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		// Готовим области строки
		ВыборкаТабличнойЧасти = Документ.Товары;
		Для каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			СтруктураСтроки = УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ,Документ);
			СтруктураСтроки.Вставить("Ячейка",СтрокаТЧ.Ячейка);
			СтруктураСтроки.Количество = СтрокаТЧ.КоличествоУчет;
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,СтруктураСтроки);

			// Доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если Документ.Товары.Индекс(СтрокаТЧ) = Документ.Товары.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
			
			// Инициализация итогов по странице.
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				НомерСтраницыПред	      = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
			
			// Добавляем итоги
			УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(СтрокаТЧ,СтруктураИтоговПоСтранице);
		КонецЦикла;

		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Получил"));
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции // ПечатьИнвентаризацияОрдерногоСклада()

Функция ПолучитьДанныеДляПечатиИНВ3(Объект) Экспорт
	
	
	ДанныеОбъекта = Новый Структура();
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИнвентаризацияОрдерногоСкладаТовары.Ссылка,
	               |	ИнвентаризацияОрдерногоСкладаТовары.НомерСтроки,
	               |	ИнвентаризацияОрдерногоСкладаТовары.Номенклатура,
	               |	ИнвентаризацияОрдерногоСкладаТовары.Количество КАК КоличествоКнижн,
	               |	ИнвентаризацияОрдерногоСкладаТовары.КоличествоУчет КАК КоличествоФакт,
	               |	ИнвентаризацияОрдерногоСкладаТовары.Коэффициент,
	               |	ИнвентаризацияОрдерногоСкладаТовары.Ячейка,
	               |	ИнвентаризацияОрдерногоСкладаТовары.ХарактеристикаНоменклатуры,
	               |	0 КАК Цена,
	               |	0 КАК СуммаФакт,
	               |	0 КАК СуммаКнижн
	               |ИЗ
	               |	Документ.ИнвентаризацияОрдерногоСклада.Товары КАК ИнвентаризацияОрдерногоСкладаТовары
	               |ГДЕ
	               |	ИнвентаризацияОрдерногоСкладаТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ПодготовленнаяТЧ = Запрос.Выполнить().Выгрузить();
	Валюта = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	// данные документа
	ДанныеОбъекта.Вставить("Организация"             	, Объект.Организация);
	ДанныеОбъекта.Вставить("Валюта"        				, Валюта);
	ДанныеОбъекта.Вставить("Дата"                   	, Объект.Дата);
	ДанныеОбъекта.Вставить("ДокументОснование"     		, "");
	ДанныеОбъекта.Вставить("ВыборкаТабличнойЧасти" 		, ПодготовленнаяТЧ);
	ДанныеОбъекта.Вставить("ПодразделениеКомпании"  	, Объект.ПодразделениеКомпании);
	ДанныеОбъекта.Вставить("ОснованиеДата"         		, "");
	ДанныеОбъекта.Вставить("ОснованиеНомер"         	, "");
	
	// свойства
	ИскомыеСвойства = Новый Массив();
	ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаНачала);
	ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаКонца);   
	ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.МОЛ);
	
	ЗначенияСвойствОбъекта = УправлениеСвойствами.ПолучитьЗначенияСвойств(Объект, Истина, Истина, ИскомыеСвойства);
	
	ДанныеОбъекта.Вставить("ДатаНачалаИнвентаризации"   , УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("ДатаНачала", ЗначенияСвойствОбъекта,Объект.Дата));
	ДанныеОбъекта.Вставить("ДатаОкончанияИнвентаризации", УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("ДатаКонца", ЗначенияСвойствОбъекта,Объект.Дата));
	ДанныеОбъекта.Вставить("МОЛ", УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("МОЛ", ЗначенияСвойствОбъекта,Объект.СкладКомпании.МОЛ));
	ДанныеОбъекта.Вставить("ПредседательКомиссии" , УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Объект,"ПредседательКомиссии"));
	ДанныеОбъекта.Вставить("ЧленКомиссии1"     , УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Объект,"ЧленКомиссии1"));
	ДанныеОбъекта.Вставить("ЧленКомиссии2"     , УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Объект,"ЧленКомиссии2"));
	
	Возврат ДанныеОбъекта;
КонецФункции

Функция ПолучитьДанныеДляПечатиИНВ19(Объект) Экспорт
	
	ДанныеОбъекта = Новый Структура();
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИнвентаризацияОрдерногоСкладаТовары.Ссылка,
	               |	ИнвентаризацияОрдерногоСкладаТовары.НомерСтроки,
	               |	ИнвентаризацияОрдерногоСкладаТовары.Номенклатура,
	               |	ИнвентаризацияОрдерногоСкладаТовары.Количество КАК КоличествоКнижн,
	               |	ИнвентаризацияОрдерногоСкладаТовары.КоличествоУчет КАК КоличествоФакт,
	               |	ИнвентаризацияОрдерногоСкладаТовары.Коэффициент,
	               |	ИнвентаризацияОрдерногоСкладаТовары.Ячейка,
	               |	ИнвентаризацияОрдерногоСкладаТовары.ХарактеристикаНоменклатуры,
	               |	0 КАК Цена,
	               |	0 КАК СуммаФакт,
	               |	0 КАК СуммаКнижн
	               |ИЗ
	               |	Документ.ИнвентаризацияОрдерногоСклада.Товары КАК ИнвентаризацияОрдерногоСкладаТовары
	               |ГДЕ
	               |	ИнвентаризацияОрдерногоСкладаТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ПодготовленнаяТЧ = Запрос.Выполнить().Выгрузить();
	
	Валюта = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	// данные документа
	ДанныеОбъекта.Вставить("Организация"             	, Объект.Организация);
	ДанныеОбъекта.Вставить("Валюта"        				, Валюта);
	ДанныеОбъекта.Вставить("Дата"                   	, Объект.Дата);
	ДанныеОбъекта.Вставить("ДокументОснование"     		, "");
	ДанныеОбъекта.Вставить("ВыборкаТабличнойЧасти" 		, ПодготовленнаяТЧ);
	ДанныеОбъекта.Вставить("ПодразделениеКомпании"  	, Объект.ПодразделениеКомпании);
	ДанныеОбъекта.Вставить("ОснованиеДата"         		, "");
	ДанныеОбъекта.Вставить("ОснованиеНомер"         	, "");
	ДанныеОбъекта.Вставить("ЕстьДвиженияПоРегистру"     , Ложь);
	ДанныеОбъекта.Вставить("ПростоеСписание"    		, Ложь);
	
	// свойства
	ИскомыеСвойства = Новый Массив();
	ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаНачала);
	ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаКонца);   
	ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.МОЛ);
	
	ЗначенияСвойствОбъекта = УправлениеСвойствами.ПолучитьЗначенияСвойств(Объект, Истина, Истина, ИскомыеСвойства);
	
	ДанныеОбъекта.Вставить("ДатаНачалаИнвентаризации"   , УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("ДатаНачала", ЗначенияСвойствОбъекта,Объект.Дата));
	ДанныеОбъекта.Вставить("ДатаОкончанияИнвентаризации", УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("ДатаКонца", ЗначенияСвойствОбъекта,Объект.Дата));
	ДанныеОбъекта.Вставить("МОЛ", УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("МОЛ", ЗначенияСвойствОбъекта,Объект.СкладКомпании.МОЛ));
	ДанныеОбъекта.Вставить("ГлавныйБухгалтер" , УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Объект,"ГлавныйБухгалтер"));
		
	Возврат ДанныеОбъекта;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "СкладКомпании", "Справочник.СкладыКомпании.ФормаСписка",,, ИСТИНА, НСтр("ru = 'Необходимо выбрать склад компании.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьСкладскимиОстатками",, "Товары", НСтр("ru = 'Заполнить складскими остатками'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "СкладКомпании", "Справочник.СкладыКомпании.ФормаСписка",,, ИСТИНА, НСтр("ru = 'Необходимо выбрать склад компании.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьСкладскимиОстаткамиПоГруппе", "ТоварыЗаполнитьСкладскимиОстатками", "Товары", НСтр("ru = 'Заполнить складскими остатками по группе'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоГруппеНоменклатуры", "ЗаполнитьДокументНоменклатурой", "Товары", НСтр("ru = 'Заполнить по группе номенклатуры'"), ПараметрыКоманды);
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьВсейНоменклатурой", "ЗаполнитьДокументНоменклатурой", "Товары", НСтр("ru = 'Заполнить всей номенклатурой'"));
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "СкладКомпании", "Справочник.СкладыКомпании.ФормаСписка",,, ИСТИНА, НСтр("ru = 'Необходимо выбрать склад компании.'"));
	Отбор = Новый Структура("Владелец", "СкладКомпании");
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "МассивЯчеек", "Справочник.ЯчейкиХранения.ФормаСписка",Новый Структура("РежимВыбора,МножественныйВыбор,Отбор", ИСТИНА, ИСТИНА, Отбор),, ИСТИНА, НСтр("ru = 'Необходимо выбрать массив ячеек.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьСкладскимиОстаткамиПоВыбраннойЯчейке", "ТоварыЗаполнитьСкладскимиОстатками", "Товары", НСтр("ru = 'Заполнить складскими остатками по ячейке'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыСвернутьОдинаковыеСтроки","ТоварыСвернутьОдинаковыеСтроки", "Товары", НСтр("ru = 'Свернуть одинаковые строки'"), ПараметрыКоманды,,,, ЛОЖЬ, ИСТИНА);
	
	ПараметрыКоманды = Новый Структура();
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыОбнулитьКоличествоФакт","ТоварыОбнулитьКоличествоФакт", "Товары", НСтр("ru = 'Обнулить фактическое количество'"), ПараметрыКоманды,,,, ЛОЖЬ, ИСТИНА);
	
	ПараметрыКоманды = Новый Структура();
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыСравнятьРасчетФакт","ТоварыСравнятьРасчетФакт", "Товары", НСтр("ru = 'Заполнить фактическое количество расчетным'"), ПараметрыКоманды,,,, ЛОЖЬ, ИСТИНА);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьСкладскимиОстатками.Видимость",                    Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьСкладскимиОстатками.Доступность",                  Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьСкладскимиОстаткамиПоГруппе.Видимость",            Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьСкладскимиОстаткамиПоГруппе.Доступность",          Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоГруппеНоменклатуры.Видимость",                   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоГруппеНоменклатуры.Доступность",                 Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьВсейНоменклатурой.Видимость",                      Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьВсейНоменклатурой.Доступность",                    Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьСкладскимиОстаткамиПоВыбраннойЯчейке.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьСкладскимиОстаткамиПоВыбраннойЯчейке.Доступность", Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа складскими остатками
//
Функция ТоварыЗаполнитьСкладскимиОстатками(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Произведем корректировку значений реквизитов объекта в соответствии с параметрами заполнения.
	Если НЕ Объект.СкладКомпании = ПараметрыЗаполнения.СкладКомпании Тогда
		Объект.СкладКомпании = ПараметрыЗаполнения.СкладКомпании;
		СкладКомпанииПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ИмяКоманды = "ТоварыЗаполнитьСкладскимиОстаткамиПоВыбраннойЯчейке" Тогда
		Если Объект.СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.ОрдерныйЯчеистый Тогда
			Результат = ЗаполнениеДокументовСервер.ЗаполнитьСкладскимиОстаткамиПоВыбраннойЯчейке(Объект, ПараметрыЗаполнения);
		Иначе
			ВывестиСообщение(НСтр("ru='Заполнение возможно только для ячеистого склада .'"), Объект);
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		// Формируем данные по командам получения складских остатков и по группе
		ПараметрыЗаполнения.Вставить("ИмяРегистра", "ОстаткиТоваровОрдерныйСклад");
		
		// получим таблицу остатков товаров
		Результат = ЗаполнениеДокументовСервер.ПолучитьСкладскиеОстатки(Объект, ПараметрыЗаполнения);
	КонецЕсли;
	
	ЯчеистыйСклад = (Объект.СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Ячеистый ИЛИ Объект.СкладКомпании.ВидСклада  = Перечисления.ВидыСкладов.ОрдерныйЯчеистый);
	
	// Заполним табличную часть "Товары" полученными складскими остатками
	Для Каждого СтрокаТЧ Из Результат Цикл
		НоваяСтрока 				= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура	= СтрокаТЧ.Номенклатура;
		Если Объект.СкладКомпании.УчетЕдиницИзмерения <> Перечисления.ВидыУчетаЕдиницИзмерения.НеВедется Тогда
			Если ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмерения) Тогда
				НоваяСтрока.ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
				КоэффициентПересчета         = СтрокаТЧ.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент/СтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
				НоваяСтрока.Количество       = СтрокаТЧ.Количество * КоэффициентПересчета;
			КонецЕсли;
		Иначе
			НоваяСтрока.ЕдиницаИзмерения = СтрокаТЧ.Номенклатура.ОсновнаяЕдиницаИзмерения;
			НоваяСтрока.Количество       = СтрокаТЧ.Количество*СтрокаТЧ.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока,ПараметрыДействия);
		ТоварыКоличествоПриИзменении(Объект, НоваяСтрока,ПараметрыДействия);
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТЧ.ХарактеристикаНоменклатуры;
		ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, НоваяСтрока,ПараметрыДействия);
		Если ЯчеистыйСклад Тогда
			НоваяСтрока.Ячейка	= СтрокаТЧ.Ячейка;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьСкладскимиОстатками()

// Обработчик заполнения документа номенклатурой из справочника
//
Функция ЗаполнитьДокументНоменклатурой(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	Родитель=Неопределено;
	Если ПараметрыЗаполнения.ИмяКоманды="ТоварыЗаполнитьПоГруппеНоменклатуры" Тогда
		Родитель = ПараметрыЗаполнения.ГруппаНоменклатуры;
	КонецЕсли;
	
	Выборка=Справочники.Номенклатура.ВыбратьИерархически(Родитель);
	Товары = Объект.Товары.Выгрузить();
	Пока Выборка.Следующий() Цикл
		
		// пропустим группы и все что есть в таблице
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Услуга ИЛИ Выборка.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Набор Тогда
			Продолжить;
		КонецЕсли;
		
		Если Товары.Найти(Выборка.Ссылка,"Номенклатура")<>Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		// добавляем строку
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура=Выборка.Ссылка;
		
		// отработаем изменение номенклатуры
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока);
		
	КонецЦикла;
	
КонецФункции // ЗаполнитьДокументНоменклатурой()

// Обработчик сворачивания строк товаров
//
Функция ТоварыСвернутьОдинаковыеСтроки(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Выгрузим товары,затем свернем
	ТаблицаТоваров = Объект.Товары.Выгрузить();
	
	// В зависимости от вида склада свернем таблицу товаров
	Если Объект.СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Ячеистый ИЛИ Объект.СкладКомпании.ВидСклада  = Перечисления.ВидыСкладов.ОрдерныйЯчеистый Тогда
		ТаблицаТоваров.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,Ячейка,ХарактеристикаНоменклатуры","КоличествоУчет,Количество");
	Иначе
		ТаблицаТоваров.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,ХарактеристикаНоменклатуры","КоличествоУчет,Количество");
	КонецЕсли;
	
	Объект.Товары.Очистить();
	Объект.Товары.Загрузить(ТаблицаТоваров);
	
КонецФункции // ТоварыСвернутьОдинаковыеСтроки()

// Обработчик обнуления фактического количества
//
Функция ТоварыОбнулитьКоличествоФакт(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	Если НЕ Объект.Товары.Количество() = 0 Тогда
		
		МассивНолей = Новый Массив(Объект.Товары.Количество());
		
		// Заполним количество нулями
		ТаблицаТоваров = Объект.Товары.Выгрузить();
		ТаблицаТоваров.ЗагрузитьКолонку(МассивНолей,"КоличествоУчет");
		Объект.Товары.Загрузить(ТаблицаТоваров);
		
		// Обработаем изменение количества
		Для Каждого СтрокаТовар Из Объект.Товары Цикл
			ТоварыКоличествоУчетПриИзменении(Объект, СтрокаТовар);
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // ТоварыОбнулитьКоличествоФакт()

// Обработчик заполнения расчетного количества фактическим
//
Функция ТоварыСравнятьРасчетФакт(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	Если НЕ Объект.Товары.Количество() = 0 Тогда
		
		ТаблицаТоваров = Объект.Товары.Выгрузить();
		
		ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("Количество"),"КоличествоУчет");
		
		Объект.Товары.Загрузить(ТаблицаТоваров);
		
		// Обработаем изменение количества
		Для Каждого СтрокаТовар Из Объект.Товары Цикл
			ТоварыКоличествоУчетПриИзменении(Объект, СтрокаТовар);
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // ТоварыСравнятьРасчетФакт()

#КонецЕсли
